# ------------------------
# CLI
# ------------------------

brew "git"
brew "gh"
brew "curl"
brew "wget"
brew "jq"
brew "tree"
brew "htop"
brew "fzf"

# ------------------------
# Python
# ------------------------

brew "python"
brew "uv"

# ------------------------
# Javascript
# ------------------------

brew "node"
brew "pnpm"

# ------------------------
# Database
# ------------------------

brew "postgresql@16"
brew "redis"

# ------------------------
# Utilities
# ------------------------

brew "watch"

# ------------------------
# Applications
# ------------------------

cask "visual-studio-code"

# Docker Desktop è già installato